madmoney99/OH-Sketches/boards.txt
##############################################################

ecsleonardo.name=ECS PANEL
ecsleonardo.vid.0=0x2341
ecsleonardo.pid.0=0x0036
ecsleonardo.vid.1=0x2341
ecsleonardo.pid.1=0x8036
ecsleonardo.vid.2=0x2A03
ecsleonardo.pid.2=0x0036
ecsleonardo.vid.3=0x2A03
ecsleonardo.pid.3=0x8036
ecsleonardo.upload_port.0.vid=0x2341
ecsleonardo.upload_port.0.pid=0x0036
ecsleonardo.upload_port.1.vid=0x2341
ecsleonardo.upload_port.1.pid=0x8036
ecsleonardo.upload_port.2.vid=0x2A03
ecsleonardo.upload_port.2.pid=0x0036
ecsleonardo.upload_port.3.vid=0x2A03
ecsleonardo.upload_port.3.pid=0x8036
ecsleonardo.upload_port.4.board=leonardo

ecsleonardo.upload.tool=avrdude
ecsleonardo.upload.tool.default=avrdude
ecsleonardo.upload.tool.network=arduino_ota
ecsleonardo.upload.protocol=avr109
ecsleonardo.upload.maximum_size=28672
ecsleonardo.upload.maximum_data_size=2560
ecsleonardo.upload.speed=57600
ecsleonardo.upload.disable_flushing=true
ecsleonardo.upload.use_1200bps_touch=true
ecsleonardo.upload.wait_for_upload_port=true

ecsleonardo.bootloader.tool=avrdude
ecsleonardo.bootloader.tool.default=avrdude
ecsleonardo.bootloader.low_fuses=0xff
ecsleonardo.bootloader.high_fuses=0xd8
ecsleonardo.bootloader.extended_fuses=0xcb
ecsleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
ecsleonardo.bootloader.unlock_bits=0x3F
ecsleonardo.bootloader.lock_bits=0x2F

ecsleonardo.build.mcu=atmega32u4
ecsleonardo.build.f_cpu=16000000L
ecsleonardo.build.vid=0x2341
ecsleonardo.build.pid=0x8042
ecsleonardo.build.usb_product="ECS PANEL"
ecsleonardo.build.board=AVR_LEONARDO
ecsleonardo.build.core=arduino
ecsleonardo.build.variant=leonardo
ecsleonardo.build.extra_flags={build.usb_flags}

##############################################################

intrleonardo.name=INTR LT PANEL
intrleonardo.vid.0=0x2341
intrleonardo.pid.0=0x0036
intrleonardo.vid.1=0x2341
intrleonardo.pid.1=0x8036
intrleonardo.vid.2=0x2A03
intrleonardo.pid.2=0x0036
intrleonardo.vid.3=0x2A03
intrleonardo.pid.3=0x8036
intrleonardo.upload_port.0.vid=0x2341
intrleonardo.upload_port.0.pid=0x0036
intrleonardo.upload_port.1.vid=0x2341
intrleonardo.upload_port.1.pid=0x8036
intrleonardo.upload_port.2.vid=0x2A03
intrleonardo.upload_port.2.pid=0x0036
intrleonardo.upload_port.3.vid=0x2A03
intrleonardo.upload_port.3.pid=0x8036
intrleonardo.upload_port.4.board=leonardo

intrleonardo.upload.tool=avrdude
intrleonardo.upload.tool.default=avrdude
intrleonardo.upload.tool.network=arduino_ota
intrleonardo.upload.protocol=avr109
intrleonardo.upload.maximum_size=28672
intrleonardo.upload.maximum_data_size=2560
intrleonardo.upload.speed=57600
intrleonardo.upload.disable_flushing=true
intrleonardo.upload.use_1200bps_touch=true
intrleonardo.upload.wait_for_upload_port=true

intrleonardo.bootloader.tool=avrdude
intrleonardo.bootloader.tool.default=avrdude
intrleonardo.bootloader.low_fuses=0xff
intrleonardo.bootloader.high_fuses=0xd8
intrleonardo.bootloader.extended_fuses=0xcb
intrleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
intrleonardo.bootloader.unlock_bits=0x3F
intrleonardo.bootloader.lock_bits=0x2F

intrleonardo.build.mcu=atmega32u4
intrleonardo.build.f_cpu=16000000L
intrleonardo.build.vid=0x2341
intrleonardo.build.pid=0x8043
intrleonardo.build.usb_product="INTR LT PANEL"
intrleonardo.build.board=AVR_LEONARDO
intrleonardo.build.core=arduino
intrleonardo.build.variant=leonardo
intrleonardo.build.extra_flags={build.usb_flags}

##############################################################

simleonardo.name=SIM PANEL
simleonardo.vid.0=0x2341
simleonardo.pid.0=0x0036
simleonardo.vid.1=0x2341
simleonardo.pid.1=0x8036
simleonardo.vid.2=0x2A03
simleonardo.pid.2=0x0036
simleonardo.vid.3=0x2A03
simleonardo.pid.3=0x8036
simleonardo.upload_port.0.vid=0x2341
simleonardo.upload_port.0.pid=0x0036
simleonardo.upload_port.1.vid=0x2341
simleonardo.upload_port.1.pid=0x8036
simleonardo.upload_port.2.vid=0x2A03
simleonardo.upload_port.2.pid=0x0036
simleonardo.upload_port.3.vid=0x2A03
simleonardo.upload_port.3.pid=0x8036
simleonardo.upload_port.4.board=leonardo

simleonardo.upload.tool=avrdude
simleonardo.upload.tool.default=avrdude
simleonardo.upload.tool.network=arduino_ota
simleonardo.upload.protocol=avr109
simleonardo.upload.maximum_size=28672
simleonardo.upload.maximum_data_size=2560
simleonardo.upload.speed=57600
simleonardo.upload.disable_flushing=true
simleonardo.upload.use_1200bps_touch=true
simleonardo.upload.wait_for_upload_port=true

simleonardo.bootloader.tool=avrdude
simleonardo.bootloader.tool.default=avrdude
simleonardo.bootloader.low_fuses=0xff
simleonardo.bootloader.high_fuses=0xd8
simleonardo.bootloader.extended_fuses=0xcb
simleonardo.bootloader.file=caterina/Caterina-Leonardo.hex
simleonardo.bootloader.unlock_bits=0x3F
simleonardo.bootloader.lock_bits=0x2F

simleonardo.build.mcu=atmega32u4
simleonardo.build.f_cpu=16000000L
simleonardo.build.vid=0x2341
simleonardo.build.pid=0x8044
simleonardo.build.usb_product="SIM PANEL"
simleonardo.build.board=AVR_LEONARDO
simleonardo.build.core=arduino
simleonardo.build.variant=leonardo
simleonardo.build.extra_flags={build.usb_flags}

##############################################################

KY58leonardo.name=KY58 PANEL
KY58leonardo.vid.0=0x2341
KY58leonardo.pid.0=0x0036
KY58leonardo.vid.1=0x2341
KY58leonardo.pid.1=0x8036
KY58leonardo.vid.2=0x2A03
KY58leonardo.pid.2=0x0036
KY58leonardo.vid.3=0x2A03
KY58leonardo.pid.3=0x8036
KY58leonardo.upload_port.0.vid=0x2341
KY58leonardo.upload_port.0.pid=0x0036
KY58leonardo.upload_port.1.vid=0x2341
KY58leonardo.upload_port.1.pid=0x8036
KY58leonardo.upload_port.2.vid=0x2A03
KY58leonardo.upload_port.2.pid=0x0036
KY58leonardo.upload_port.3.vid=0x2A03
KY58leonardo.upload_port.3.pid=0x8036
KY58leonardo.upload_port.4.board=leonardo

KY58leonardo.upload.tool=avrdude
KY58leonardo.upload.tool.default=avrdude
KY58leonardo.upload.tool.network=arduino_ota
KY58leonardo.upload.protocol=avr109
KY58leonardo.upload.maximum_size=28672
KY58leonardo.upload.maximum_data_size=2560
KY58leonardo.upload.speed=57600
KY58leonardo.upload.disable_flushing=true
KY58leonardo.upload.use_1200bps_touch=true
KY58leonardo.upload.wait_for_upload_port=true

KY58leonardo.bootloader.tool=avrdude
KY58leonardo.bootloader.tool.default=avrdude
KY58leonardo.bootloader.low_fuses=0xff
KY58leonardo.bootloader.high_fuses=0xd8
KY58leonardo.bootloader.extended_fuses=0xcb
KY58leonardo.bootloader.file=caterina/Caterina-Leonardo.hex
KY58leonardo.bootloader.unlock_bits=0x3F
KY58leonardo.bootloader.lock_bits=0x2F

KY58leonardo.build.mcu=atmega32u4
KY58leonardo.build.f_cpu=16000000L
KY58leonardo.build.vid=0x2341
KY58leonardo.build.pid=0x8045
KY58leonardo.build.usb_product="KY58 PANEL"
KY58leonardo.build.board=AVR_LEONARDO
KY58leonardo.build.core=arduino
KY58leonardo.build.variant=leonardo
KY58leonardo.build.extra_flags={build.usb_flags}

